---
kind: property
id: P:Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.PhotometricWebFile
source: html/e9f78e79-9a67-e911-3fb9-bd9a316043dc.htm
---
# Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.PhotometricWebFile Property

The filename of an IES photometric web file.

## Syntax (C#)
```csharp
public string PhotometricWebFile { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null